In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser = Series(randn(6), index=[[1,1,1,2,2,2], ['a', 'b', 'c', 'a', 'b', 'c']])
ser

1  a    0.127048
   b    1.086061
   c    0.861671
2  a   -0.241750
   b   -1.619383
   c   -0.755944
dtype: float64

In [3]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [4]:
ser[1]

a    0.127048
b    1.086061
c    0.861671
dtype: float64

In [5]:
ser[2]

a   -0.241750
b   -1.619383
c   -0.755944
dtype: float64

In [7]:
ser[:,'a'] #getting values stored at index a

1    0.127048
2   -0.241750
dtype: float64

In [8]:
#converting multiindex Sereis into dataframes

In [10]:
dframe = ser.unstack()
dframe

          a         b         c
1  0.127048  1.086061  0.861671
2 -0.241750 -1.619383 -0.755944

In [11]:
#dataframe with multiple level index
dframe2 = DataFrame(np.arange(16).reshape(4,4), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                   columns = [['NY', 'NY', 'LA', 'SF'], ['cold', 'hot', 'hot', 'cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [13]:
dframe2.index.name = ['INDEX_1', 'INDEX_2'] #naming the index

dframe2.columns.names = ['Cities', 'Temp'] #naming the columns

dframe2

Cities   NY      LA   SF
Temp   cold hot hot cold
a 1       0   1   2    3
  2       4   5   6    7
b 1       8   9  10   11
  2      12  13  14   15

In [14]:
# interchangin the order of index

In [17]:
dframe2.swaplevel('Cities', 'Temp', axis=1)

Temp   cold hot     cold
Cities   NY  NY  LA   SF
a 1       0   1   2    3
  2       4   5   6    7
b 1       8   9  10   11
  2      12  13  14   15

In [21]:
#sorting levels
dframe2.swaplevel(1)

Cities   NY      LA   SF
Temp   cold hot hot cold
a 1       0   1   2    3
  2       4   5   6    7
b 1       8   9  10   11
  2      12  13  14   15

In [23]:
#perform operations on particular levels

dframe2.sum(level='Temp', axis=1)

Temp  cold  hot
a 1      3    3
  2     11   11
b 1     19   19
  2     27   27